app/views/destinatarios/_destinatario.html.erb

SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <br>
    <%= destinatario.endereco.logradouro.present? ? "Logradouro: #{destinatario.endereco.logradouro}" : nil %><br>