app/views/remetentes/_remetente.html.erb

    <br>
    <%= remetente.endereco.logradouro.present? ? "Logradouro: #{remetente.endereco.logradouro}" : nil %><br>
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]