app/views/transportadoras/_transportadora.html.erb

    <br>
    <%= transportadora.endereco.logradouro.present? ? "Logradouro: #{transportadora.endereco.logradouro}" : nil %><br>
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]