app/controllers/destinatarios_controller.rb

  def index
    @destinatarios = Destinatario.all
---
SELECT "destinatarios".* FROM "destinatarios"

  def create
    @destinatario = Destinatario.new(destinatario_params)

    respond_to do |format|
      if @destinatario.save
---
INSERT INTO "destinatarios" ("nome", "data_nascimento", "cpf", "email", "telefone", "endereco_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_destinatario
      @destinatario = Destinatario.find(params[:id])
---
SELECT "destinatarios".* FROM "destinatarios" WHERE "destinatarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]