app/controllers/encomendas_controller.rb

SELECT "encomendas".* FROM "encomendas" WHERE (data_entrega = NULL AND peso = '200' AND transportadora_id = '')
SELECT "encomendas".* FROM "encomendas" WHERE "encomendas"."data_entrega" = ?  [["data_entrega", "2024-02-23"]]
---
  def index
    @encomendas = Encomenda.all

    if params[:data_entrega].present? || params[:peso].present? || params[:transportadora_id].present?
      @encomendas = Encomenda.search(params[:data_entrega], params[:peso], params[:transportadora_id])

INSERT INTO "encomendas" ("peso", "status", "data_entrega", "destinatario_id", "remetente_id", "created_at", "updated_at", "transportadora_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @encomenda = Encomenda.new(encomenda_params)

    respond_to do |format|
      if @encomenda.save

SELECT "encomendas".* FROM "encomendas" WHERE "encomendas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_encomenda
      @encomenda = Encomenda.find(params[:id])