app/controllers/enderecos_controller.rb

    def set_endereco
      @endereco = Endereco.find(params[:id])
---
SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]