app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios" WHERE (nome LIKE '%funcionario 1%')

  def show
    @recebimentos = @funcionario.recebimentos.includes(:encomenda)
---
SELECT "recebimentos".* FROM "recebimentos" WHERE "recebimentos"."funcionario_id" = ?  [["funcionario_id", 1]]

  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO "funcionarios" ("nome", "cargo", "data_nascimento", "cpf", "email", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]