app/controllers/recebimentos_controller.rb

  def index
    @recebimentos = Recebimento.all
---
SELECT "recebimentos".* FROM "recebimentos"

  def create
    @recebimento = Recebimento.new(recebimento_params)

    respond_to do |format|
      if @recebimento.save
---
INSERT INTO "recebimentos" ("data_recebimento", "funcionario_id", "encomenda_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["data_recebimento", "2024-02-13"], ["funcionario_id", 1], ["encomenda_id", 1], ["created_at", "2024-02-18 21:30:31.086278"], ["updated_at", "2024-02-18 21:30:31.086278"]]

    def set_recebimento
      @recebimento = Recebimento.find(params[:id])
---
SELECT "recebimentos".* FROM "recebimentos" WHERE "recebimentos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]