app/controllers/remetentes_controller.rb

SELECT "remetentes".* FROM "remetentes"
---
  def index
    @remetentes = Remetente.all

INSERT INTO "remetentes" ("nome", "email", "telefone", "endereco_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @remetente = Remetente.new(remetente_params)

    respond_to do |format|
      if @remetente.save

SELECT "remetentes".* FROM "remetentes" WHERE "remetentes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_remetente
      @remetente = Remetente.find(params[:id])