app/controllers/transportadoras_controller.rb

  def index
    @transportadoras = Transportadora.all
---
SELECT "transportadoras".* FROM "transportadoras"

  def create
    @transportadora = Transportadora.new(transportadora_params)

    respond_to do |format|
      if @transportadora.save
---
INSERT INTO "transportadoras" ("nome", "telefone", "cnpj", "endereco_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @transportadora.destroy
---
DELETE FROM "transportadoras" WHERE "transportadoras"."id" = ?  [["id", 1]]

    def set_transportadora
      @transportadora = Transportadora.find(params[:id])
---
SELECT "transportadoras".* FROM "transportadoras" WHERE "transportadoras"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]