app/views/encomendas/index.html.erb

SELECT "transportadoras".* FROM "transportadoras"
---
    <%= label_tag 'Transportadora' %>
    <%= select_tag 'transportadora_id', options_from_collection_for_select(Transportadora.all, 'id', 'nome', params[:transportadora_id]), prompt: 'Todas as transportadoras' %>